        *************** Beginning of data *************************************
0000.02   dcl-f SUBPF    disk keyed usage(*update : *delete : *output);        
0000.03   dcl-f TBSUBNUM disk usage(*update : *output);                        
0000.04   dcl-f TBPREFIX disk usage(*input);                                   
0000.05   dcl-f DSUB1    workstn sfile(sflr:rrn) sfile(pfxsfl:prrn);           
0000.06                                                                        
0000.07   dcl-S rrn   int(3);                                                  
0000.08   dcl-S prrn  int(3);                                                  
0000.09   dcl-S count int(3);                                                  
0000.10                                                                        
0000.11        *in41=*on;                                                      
0000.12        *in08=*on;                                                      
0000.13        dow not(*in03);                                                 
0000.14           *in50=*on;                                                   
0000.15           write TOP;                                                   
0000.16           write BOT;                                                   
0000.17           if *in72 or *in41;                                           
0000.18               exsr FILLSFL; 
0000.19               exfmt SFLCTL; 
0000.20           endif;            
0000.22           *in50=*off;       
0000.23           if *in06;         
0000.24              exsr add1;     
0000.25              *in41=*on;     
0000.26            else;            
0000.27              exsr tipul;    
0000.28            endif;           
0000.29        enddo;               
0000.30        *inlr=*on;           
0000.31                             
0000.32        begsr FILLSFL;       
0000.33          *in32=*on;         
0000.35          count=0;           
0000.36          if *in41;                                
0000.37             *in41=*off;                           
0000.38             *in34=*on;                            
0000.39             write SFLCTL;                         
0000.40             *in34=*off;                           
0000.41             rrn=0;                                
0000.42             setll *loval RSUB;                    
0000.45          endif;                                   
0000.46          read RSUB;                               
0000.48          dow not(%eof(SUBPF)) and not(count=6);   
0000.49             op=*blanks;                           
0000.50             rrn+=1;                               
0000.51             count+=1;                             
0000.52             write SFLR;                           
0000.53             if not(count=6);                      
0000.54                read RSUB;                         
0000.55             endif;                 
0000.56          enddo;                    
0000.57                                    
0000.58          if rrn>0;                 
0000.59            *in31=*on;              
0000.60            pos=rrn;                
0000.61          else;                     
0000.62             *in31=*off;            
0000.63          endif;                    
0000.64          if %eof(SUBPF);           
0000.65             *in33=*on;             
0000.66          endif;                    
0000.67        endsr;                      
0001.00                                    
0002.00        begsr tipul;                
0003.00          readc sflr;               
0004.00          dow not (%eof(DSUB1));        
0005.00             if op='2';                 
0006.00                exsr update1;           
0006.01                *in41=*on;              
0007.00             endif;                     
0008.00             if op='4';                 
0008.01                exsr statchg;           
0008.02                *in41=*on;              
0010.00             endif;                     
0011.00             readc sflr;                
0012.00          enddo;                        
0013.00        endsr;                          
0014.00                                        
0015.00        begsr add1;                     
0015.01          write TOP;                    
0015.02          write BOT;                    
0015.03          exsr empty;                                             
0015.04          dow not(*in03) and not(*in12) and not(*in04);           
0015.05             exfmt ADDSCRN;                                       
0015.06             if *in09;                                            
0015.07                exsr PREFIXSFL;                                   
0015.08             endif;                                               
0015.09             if *in04;                                            
0015.10                exsr checkfields;                                 
0015.11                if *in45 or *in46 or *in47 or *in48 or *in49;     
0015.12                   *in04=*off;                                    
0015.13                else;                                             
0015.14                   exsr updatetbsubnum;                           
0015.15                   SUBTEL = sprefix +'-' + %editc(telephone:'X'); 
0015.16                   substat = 'A';                                 
0015.17                   subpsw = 'PASSWORD';                           
0015.18                   write RSUB;                                    
0015.19                endif;                              
0015.21            endif;                                  
0029.00        ENDDO;                                      
0029.01        *in12=*off;                                 
0029.02        *in04=*off;                                 
0029.03        endsr;                                      
0030.00                                                    
0031.00   BEGSR UPDATE1;                                   
0032.00   WRITE TOP;                                       
0033.00   WRITE BOT;                                       
0034.00   TELEPHONE= %DEC(%SUBST(SUBTEL:5):7:0);           
0035.00   SPREFIX= %SUBST(SUBTEL:1:3);                     
0036.00   DOW NOT(*IN03) AND NOT(*IN12) AND NOT(*IN04);    
0037.00      CHAIN SUBID RSUB;                             
0038.00      EXFMT UPDATESCRN;                             
0039.00      IF *IN08;                                     
0040.00         SUBPSW='PASSWORD';                               
0041.00      ENDIF;                                              
0042.00      IF *IN09;                                           
0043.00         EXSR PREFIXSFL;                                  
0044.00      ENDIF;                                              
0045.00      IF *IN04;                                           
0046.00         IF %FOUND;                                       
0047.00            EXSR CHECKFIELDS;                             
0048.00            IF *IN45 OR *IN46 OR *IN47 OR *IN48 OR *IN49; 
0049.00               *IN04=*OFF;                                
0050.00            ELSE;                                         
0051.00            SUBTEL= SPREFIX+'-'+%EDITC(TELEPHONE:'X');    
0052.00            UPDATE RSUB;                                  
0053.00            ENDIF;                                        
0054.00         ELSE;                                            
0055.00            *IN44=*ON;                                    
0056.00            *IN04=*OFF;      
0057.00         ENDIF;              
0058.00      ENDIF;                 
0059.00   ENDDO;                    
0060.00   *IN12=*OFF;               
0061.00   *IN04=*OFF;               
0062.00   ENDSR;                    
0063.00                             
0064.00   BEGSR STATCHG;            
0065.00   WRITE TOP;                
0066.00   WRITE BOT;                
0067.00   EXFMT CHGSTATUS;          
0068.00   CHAIN SUBID RSUB;         
0069.00   IF %FOUND;                
0070.00      IF *IN04;              
0071.00         IF SUBSTAT='A';     
0072.00            SUBSTAT='D';     
0073.00         ELSE;               
0074.00            SUBSTAT='A';     
0075.00         ENDIF;              
0076.00         UPDATE RSUB;        
0077.00      ENDIF;                 
0078.00   ELSE;                     
0079.00      *IN44=*ON;             
0080.00   ENDIF;                    
0081.00   ENDSR;                    
0082.00                             
0083.00   BEGSR PREFIXSFL;          
0084.00   *IN34=*ON;                
0085.00   *IN32=*ON;                
0086.00   WRITE PFXCTL;             
0087.00   *IN34=*OFF;               
0088.00   PRRN=0;                  
0089.00   SETLL *START TBPREFIX;   
0090.00   READ RPREFIX;            
0091.00   DOW NOT(%EOF(TBPREFIX)); 
0092.00      OP=*BLANKS;           
0093.00      PRRN+=1;              
0094.00      WRITE PFXSFL;         
0095.00      READ RPREFIX;         
0096.00   ENDDO;                   
0097.00   IF PRRN > 0;             
0098.00      *IN31=*ON;            
0099.00      *IN33=*ON;            
0100.00      POS=1;                
0101.00      EXFMT PFXCTL;         
0102.00      READC PFXSFL;         
0103.00      IF OP='Y';            
0104.00         SPREFIX=%EDITC(PREFIX:'X');               
0105.00      ENDIF;                                       
0106.00   ENDIF;                                          
0107.00   ENDSR;                                          
0108.00                                                   
0109.00   BEGSR CHECKFIELDS;                              
0110.00   IF SUBNAME=*BLANKS;                             
0111.00      *IN45=*ON;                                   
0112.00   ENDIF;                                          
0113.00   IF SPREFIX=*BLANKS;                             
0114.00      *IN46=*ON;                                   
0115.00   ENDIF;                                          
0116.00   IF TELEPHONE=0 OR NOT(%LEN(TELEPHONE) = 7);     
0117.00      *IN47=*ON;                                   
0118.00   ENDIF;                                          
0119.00   IF %SCAN('@':SUBEMAIL) = 0;                     
0120.00      *IN48=*ON;                             
0121.00   ENDIF;                                    
0122.00   IF SUBCC4=0 OR NOT(%LEN(SUBCC4) = 4);     
0123.00      *IN49=*ON;                             
0124.00   ENDIF;                                    
0125.00   ENDSR;                                    
0126.00                                             
0127.00   BEGSR UPDATETBSUBNUM;                     
0128.00   SETLL *START TBSUBNUM;                    
0129.00   READ RSUBNUM;                             
0130.00   SUBID = SUBNUM +1;                        
0131.00   SUBNUM = SUBID;                           
0132.00   WRITE RSUBNUM;                            
0133.00   ENDSR;                                    
0134.00                                             
0135.00   BEGSR EMPTY;                              
0136.00   SUBNAME=*BLANKS;                                                      
0137.00   SUBSTAT=*BLANKS;                                                      
0138.00   TELEPHONE=0;                                                          
0139.00   SPREFIX=*BLANKS;                                                      
0140.00   SUBEMAIL=*BLANKS;                                                     
0141.00   SUBCC4=0;                                                             
0142.00   ENDSR;                                                                
        ****************** End of data **************************************** 
