        *************** Beginning of data *************************************
0000.02   dcl-f SUBPF    disk keyed usage(*input);                             
0000.03   dcl-f SUBSFL   workstn sfile(sflr:rrn);                              
0000.04                                                                        
0000.05   dcl-S rrn   int(3);                                                  
0000.06   dcl-S count int(3);                                                  
0000.07                                                                        
0000.09        rrn=0;                                                          
0000.10        *in41=*on;                                                      
0000.12           dow not(*in03);                                              
0000.13              write TOP;                                                
0000.14              write BOT;                                                
0000.15              if *in72 or *in41;                                        
0000.16                  exsr FILLSFL;                                         
0000.17                  exfmt SFLCTL;                                         
0000.18              endif;                                                    
0000.24          enddo;                                                        
0000.25        *inlr=*on;                                
0000.26                                                  
0000.27        begsr FILLSFL;                            
0000.28          *in32=*on;                              
0000.29          write SFLCTL;                           
0000.30          count=0;                                
0000.31          if *in41;                               
0000.32             setll *loval RSUB;                   
0000.33             *in41=*off;                          
0000.34          endif;                                  
0000.35          read RSUB;                              
0000.36          dow not(%eof(SUBPF)) and not(count=6);  
0000.37             op=*blanks;                          
0000.38             rrn+=1;                              
0000.39             count+=1;                            
0000.40             write SFLR;                          
0000.41             if not(count=6);    
0000.42                read RSUB;                                               
0000.43             endif;                                                      
0000.44          enddo;                                                         
0000.45                                                                         
0000.46          if rrn>0;                                                      
0000.47            *in31=*on;                                                   
0000.48            pos=rrn;                                                     
0000.49          else;                                                          
0000.50             *in31=*off;                                                 
0000.51          endif;                                                         
0000.53          if %eof(subpf);                                                
0000.56            *in33=*on;                                                   
0000.60          endif;                                                         
0000.61        endsr;                                                           
        ****************** End of data **************************************** 
